app/controllers/api/v1/courses_controller.rb

  def index
    @courses = Course.includes(:tutors).all.paginate(page: params[:page], per_page: params[:per_page])
---
SELECT COUNT(*) FROM "courses"
SELECT "courses".* FROM "courses"
SELECT "tutors".* FROM "tutors" WHERE "tutors"."course_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9)  [["course_id", 1], ["course_id", 2], ["course_id", 3], ["course_id", 4], ["course_id", 5], ["course_id", 6], ["course_id", 7], ["course_id", 8], ["course_id", 9]]

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "C++"], ["description", "Description for C++"], ["created_at", "2023-02-09 07:25:03.188005"], ["updated_at", "2023-02-09 07:25:03.188005"]]